Table of Contents
 Class TimeAxis
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Time axis
public class TimeAxis : OpenObject
Inheritance
object
OpenObject
TimeAxis
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 TimeAxis()
Constructor
public TimeAxis()
Properties
 CreepTime
time from which the creep is calculated
public double CreepTime { get; set; }
Property Value
double
 Times
Times
public List<TimePoint> Times { get; set; }
Property Value
List<TimePoint>
 Edit this page